[
  {
    "slug": "code-xr",
    "title": "Code-XR",
    "period": "Feb 2025–Jul 2025",
    "featured": true,
    "type": "openSource",
    "summary_en": "Code-XR is an open-source Visual Studio Code extension that provides immersive XR-based visualization of software metrics. It transforms static analysis data into an interactive 3D environment, enabling developers to explore complex codebases through spatial metaphors. The tool integrates a static analysis pipeline and renders metrics inside an XR scene, allowing users to identify hotspots, structural issues, and architectural patterns in a more intuitive and exploratory way.",
    "summary_es": "Code-XR es una extensión gratuita de Visual Studio Code que proporciona visualización inmersiva basada en XR de métricas de software. Transforma datos de análisis estático en un entorno 3D interactivo, permitiendo a los desarrolladores explorar bases de código complejas a través de metáforas espaciales. La herramienta integra un pipeline de análisis estático y renderiza métricas dentro de una escena XR, permitiendo a los usuarios identificar hotspots, problemas estructurales y patrones arquitectónicos de manera más intuitiva y exploratoria.",
    "tags": ["VS Code Extension API", "Python", "TypeScript", "A-Frame", "BabiaXR"],
    "repoUrl": "https://github.com/aMonteSl/CodeXR",
    "demoUrl": "https://amontesl.github.io/code-xr-docs/",
    "imageDir": "/projects/code-xr",
    "images": [
      "logo.png",
      "html-analisis.png",
      "ejemplo2.png",
      "ejemplo1.png",
      "ar2-experience.png",
      "ar-experience.png"
    ],
    "heroImage": "logo.png",
    "highlights_en": [
      "Problem → Traditional metric tools present data in static dashboards, making it hard to understand large codebases at a glance and detect hotspots quickly.",
      "Solution → Spatial visualization metaphor where files and modules map to a 3D environment with metrics represented visually for intuitive comprehension.",
      "Impact → Accepted at VISSOFT @ ICSME 2025 • 300+ downloads • Active and maintained"
    ],
    "highlights_es": [
      "Problema → Las herramientas de métricas tradicionales presentan datos en dashboards estáticos, dificultando la comprensión de bases de código grandes de un vistazo.",
      "Solución → Metáfora de visualización espacial donde archivos y módulos se mapean a un entorno 3D con métricas representadas visualmente para comprensión intuitiva.",
      "Impacto → Aceptado en VISSOFT @ ICSME 2025 • 300+ descargas • Activo y mantenido"
    ],
    "role_en": "Sole author and end-to-end developer. Built the full system: VS Code extension, Python static analysis pipeline, JSON data persistence, XR 3D visualization with BabiaXR, and documentation site (React + Vite + Tailwind). Academic supervision by David Moreno Lumbreras (PhD, TFG supervisor).",
    "role_es": "Autor único y desarrollador integral. Construí el sistema completo: extensión VS Code, pipeline de análisis estático en Python, persistencia de datos en JSON, visualización 3D XR con BabiaXR y sitio de documentación (React + Vite + Tailwind). Supervisión académica de David Moreno Lumbreras (PhD, supervisor TFG).",
    "supervisorName": "David Moreno Lumbreras",
    "supervisorUrl": "https://dlumbrer.gitlab.io/",
    "tech": ["Node.js", "TypeScript", "Python", "VS Code Extension API", "WebXR", "A-Frame", "BabiaXR", "JSON", "React", "Vite", "Tailwind"]
  },
  {
    "slug": "obt",
    "title": "OBT — Online Booking Tool",
    "period": "Nov 2025–Feb 2026",
    "featured": true,
    "type": "academic",
    "summary_en": "SaaS platform built during VBGroup internship for managing travel booking requests across client companies. Clients submit trip requirements → VBGroup agents create cost estimates → upon approval, agents process reservations and send confirmations. Features 5 role-based access tiers, automated email notifications with JWT-secured interactive buttons, and scalable MVC architecture. Also designed all backend databases.",
    "summary_es": "Plataforma SaaS desarrollada durante prácticas en VBGroup para gestionar solicitudes de reservas de viajes de empresas clientes. Los clientes envían requisitos de viaje → agentes de VBGroup crean presupuestos → una vez aprobado, agentes procesan reservas y envían confirmaciones. Incluye 5 niveles de acceso basados en roles, notificaciones por email automáticas con botones interactivos asegurados con JWT, y arquitectura MVC escalable. También diseñé todas las bases de datos backend.",
    "tags": ["Nest.js", "TypeScript", "React", "Azure CosmosDB", "REST API"],
    "repoUrl": "",
    "demoUrl": "",
    "imageDir": "/projects/obt",
    "images": [],
    "heroImage": "placeholder.svg",
    "highlights_en": [
      "Architecture → Designed scalable role-based backend (RBAC with 5 distinct roles: SuperAdmin, Admin, Agent, Manager, Employee) using clean MVC patterns with middleware-driven access control. Also designed and architected all CosmosDB and Blob Storage schemas.",
      "Email system → Implemented interactive JWT-secured button actions directly within emails for cost estimate approvals, travel notifications, and booking confirmations. Emails generated dynamically based on role and booking state.",
      "Full-stack evolution → Started contributing as backend-only (API + database design), evolved to full-stack managing React frontend, state management, complex booking workflows, and REST API consumption."
    ],
    "highlights_es": [
      "Arquitectura → Backend escalable basado en roles (RBAC con 5 roles: SuperAdmin, Admin, Agent, Manager, Employee) usando patrones MVC limpios con control de acceso mediante middlewares. También diseñé y arquitecturé todos los esquemas de CosmosDB y Blob Storage.",
      "Sistema de emails → Botones interactivos con JWT directamente en emails para aprobaciones de presupuestos, notificaciones de viajes y confirmaciones de reservas. Emails generados dinámicamente según rol y estado de reserva.",
      "Evolución full-stack → Comenzó solo backend (API + diseño de BD), evolucionó a full-stack gestionando frontend React, gestión de estado, flujos complejos de reserva y consumo de APIs REST."
    ],
    "role_en": "Initially backend architect and developer, evolved to full-stack. Designed REST API architecture (Nest.js, TypeScript, Swagger) with JWT-based email security, RBAC middleware, and clean MVC patterns. Architected CosmosDB collections and Blob Storage containers for travel data, cost estimates, and user documents. Later contributed to React + Vite frontend, complex state management for multi-step booking workflows, and seamless API integration.",
    "role_es": "Inicialmente arquitecto backend y developer, evolucionó a full-stack. Diseñé arquitectura de API REST (Nest.js, TypeScript, Swagger) con seguridad en emails basada en JWT, middleware RBAC, y patrones MVC limpios. Arquitecturé colecciones de CosmosDB y contenedores de Blob Storage para datos de viajes, presupuestos y documentos de usuarios. Posteriormente contribuí al frontend React + Vite, gestión de estado compleja para flujos de reserva multi-paso, e integración fluida de APIs.",
    "tech": ["Nest.js", "TypeScript", "Swagger", "TSDoc", "React", "Vite", "Tailwind CSS", "Azure CosmosDB", "Azure Blob Storage", "JWT", "REST API"]
  },
  {
    "slug": "honor-course-1",
    "title": "High Distinction — AST (Telematic Systems)",
    "period": "May 2024",
    "featured": true,
    "type": "academic",
    "summary_en": "Matrícula de Honor (highest distinction) in AST (Ampliación de Sistemas Telemáticos), a course focused on techniques and technologies for developing telematic applications. Developed an embedded greenhouse system implementing user role management, real-time sensor integration, hardware component abstraction (keyboard, display, alarms), and event-driven architecture—all using object-oriented C++14 with clean layered design.",
    "summary_es": "Matrícula de Honor en AST (Ampliación de Sistemas Telemáticos), asignatura enfocada en técnicas y tecnologías para el desarrollo de aplicaciones telemáticas. Desarrollé un sistema completo de invernadero embebido implementando gestión de roles de usuario, integración de sensores en tiempo real, abstracción de componentes hardware (teclado, pantalla, alarmas) y arquitectura dirigida por eventos—todo usando C++14 orientado a objetos con diseño limpio en capas.",
    "tags": ["C++", "Object-Oriented Programming", "Shell", "Doxygen", "UMLET"],
    "repoUrl": "https://github.com/aMonteSl/GreenHouse",
    "demoUrl": "",
    "imageDir": "/projects/honor-course-1",
    "images": [],
    "heroImage": "placeholder.svg",
    "highlights_en": [
      "System design → Multi-user embedded systems with role-based access control (admin, operator, viewer). Event-driven architecture managing sensor inputs, hardware I/O, and system state atomically.",
      "Object-oriented C++ → Clean layered model abstracting hardware (GPIO, sensors, actuators) into cohesive interfaces. Demonstrated mastery of design patterns and memory management in constrained environments.",
      "Documentation & Testing → Full API documentation via Doxygen, UML diagrams with UMLET, shell test scripts for system validation. Awarded Matrícula de Honor (A+ distinction)."
    ],
    "highlights_es": [
      "Diseño de sistema → Sistemas embebidos multi-usuario con control de acceso basado en roles (admin, operador, observador). Arquitectura dirigida por eventos gestionando entradas de sensores, I/O hardware y estado del sistema atómicamente.",
      "C++ orientado a objetos → Modelo limpio en capas abstrayendo hardware (GPIO, sensores, actuadores) en interfaces cohesivas. Demostré maestría en patrones de diseño y gestión de memoria en entornos limitados.",
      "Documentación y pruebas → Documentación de API completa vía Doxygen, diagramas UML con UMLET, scripts shell para validación del sistema. Galardonado con Matrícula de Honor (distinción A+)."
    ],
    "role_en": "Solo architect and developer of embedded greenhouse system. Designed role-based access control with atomic state management. Implemented hardware abstraction layer (sensors, GPIO, display, keyboard) with event-driven cores. Full codebase in C++14 with RAII patterns, clean architecture, and comprehensive Doxygen documentation. Demonstrated command of low-level systems programming, concurrent event handling, and telematic protocols.",
    "role_es": "Arquitecto y desarrollador único del sistema de invernadero embebido. Diseñé control de acceso basado en roles con gestión de estado atómica. Implementé capa de abstracción de hardware (sensores, GPIO, pantalla, teclado) con núcleos dirigidos por eventos. Código completo en C++14 con patrones RAII, arquitectura limpia y documentación Doxygen exhaustiva. Demostré dominio de programación de sistemas de bajo nivel, manejo de eventos concurrentes y protocolos telemáticos.",
    "tech": ["C++", "Object-Oriented Programming", "Embedded Systems", "Shell Scripting", "Doxygen", "UMLET", "UML", "IoT", "Real-time Systems"]
  },
  {
    "slug": "honor-course-2",
    "title": "High Distinction — Networks",
    "period": "2023",
    "featured": true,
    "type": "academic",
    "summary_en": "Earned High Distinction (Matrícula de Honor) in computer networks with hands-on protocol implementation.",
    "summary_es": "Matrícula de Honor en redes de computadores con implementación práctica de protocolos.",
    "tags": ["Networking", "Systems", "C/C++"],
    "repoUrl": "",
    "demoUrl": "",
    "imageDir": "/projects/honor-course-2",
    "images": ["thumb-1.jpg"],
    "heroImage": "hero.jpg",
    "highlights_en": [
      "Challenge → Implement core network protocols from scratch",
      "Approach → Low-level C programming with socket APIs",
      "Result → Fully functional TCP/IP stack implementation"
    ],
    "highlights_es": [
      "Reto → Implementar protocolos de red básicos desde cero",
      "Enfoque → Programación de bajo nivel en C con APIs de sockets",
      "Resultado → Implementación completamente funcional del stack TCP/IP"
    ],
    "role_en": "Built custom network protocol implementations demonstrating deep understanding of OSI layers and practical systems programming.",
    "role_es": "Construí implementaciones personalizadas de protocolos de red demostrando profundo entendimiento de las capas OSI y programación de sistemas práctica.",
    "tech": ["C/C++", "Linux", "Sockets", "Wireshark"]
  }
]
